###################################################################

# Created by write_sdc on Thu Aug 27 12:59:42 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions -max V105WTP1250 -max_library std150e_wst_105_p125\
                         -min V135BTN0400 -min_library std150e_bst_135_n040
set_max_area 0
set_disable_timing [get_ports i_RSTN]
set_disable_timing [get_pins i2c_master/i_RSTN]
set_disable_timing [get_cells async_rstn_synchronizer]
set_disable_timing [get_cells i2c_master/async_rstn_synchronizer]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[7]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[6]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[5]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[4]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[3]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[2]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[1]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_OUT[0]}]
set_load -pin_load 0.01035 [get_ports o_MPR121_INIT_SET]
set_load -pin_load 0.01035 [get_ports o_MPR121_BUSY]
set_load -pin_load 0.01035 [get_ports o_MPR121_FAIL]
set_load -pin_load 0.01035 [get_ports o_I2C_SCL_OUT]
set_load -pin_load 0.01035 [get_ports o_I2C_SDA_OUT]
set_load -pin_load 0.01035 [get_ports o_I2C_SCL_EN]
set_load -pin_load 0.01035 [get_ports o_I2C_SDA_EN]
set_load -pin_load 0 [get_ports i_CLK]
set_load -min -pin_load 0 [get_ports i_CLK]
set_ideal_network [get_ports i_RSTN]
set_ideal_network [get_pins i2c_master/i_RSTN]
create_clock [get_ports i_CLK]  -name clk  -period 10  -waveform {0 5}
set_clock_uncertainty 0.0804  [get_clocks clk]
set_clock_transition -max -rise 0.9 [get_clocks clk]
set_clock_transition -min -rise 0.9 [get_clocks clk]
set_clock_transition -max -fall 1.2 [get_clocks clk]
set_clock_transition -min -fall 1.2 [get_clocks clk]
set_false_path   -from [get_ports i_RSTN]
set_false_path   -to [get_cells async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -through [list [get_pins i2c_master/i_RSTN]]
set_false_path   -to [get_cells i2c_master/async_rstn_synchronizer/o_RSTN_reg]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[7]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[6]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[5]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[4]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[3]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[2]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[1]}]
set_input_delay -clock clk  -max 4  [get_ports {o_MPR121_REG_ADDR[0]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[7]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[6]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[5]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[4]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[3]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[2]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[1]}]
set_input_delay -clock clk  -max 4  [get_ports {i_MPR121_DATA_IN[0]}]
set_input_delay -clock clk  -max 4  [get_ports i_MPR121_WRITE_ENABLE]
set_input_delay -clock clk  -max 4  [get_ports i_MPR121_READ_ENABLE]
set_input_delay -clock clk  -max 4  [get_ports i_I2C_SCL_IN]
set_input_delay -clock clk  -max 4  [get_ports i_I2C_SDA_IN]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[7]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[6]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[5]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[4]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[3]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[2]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[1]}]
set_output_delay -clock clk  -max 4  [get_ports {o_MPR121_DATA_OUT[0]}]
set_output_delay -clock clk  -max 4  [get_ports o_MPR121_INIT_SET]
set_output_delay -clock clk  -max 4  [get_ports o_MPR121_BUSY]
set_output_delay -clock clk  -max 4  [get_ports o_MPR121_FAIL]
set_output_delay -clock clk  -max 4  [get_ports o_I2C_SCL_OUT]
set_output_delay -clock clk  -max 4  [get_ports o_I2C_SDA_OUT]
set_output_delay -clock clk  -max 4  [get_ports o_I2C_SCL_EN]
set_output_delay -clock clk  -max 4  [get_ports o_I2C_SDA_EN]
set_load 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_RSTN]
