###################################################################

# Created by write_sdc on Wed May  6 15:35:03 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions -max V105WTP1250 -max_library std150e_wst_105_p125\
                         -min V135BTN0400 -min_library std150e_bst_135_n040
set_max_fanout 6 [current_design]
set_max_area 0
set_disable_timing [get_ports i_RSTN]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[23]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[22]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[21]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[20]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[19]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[18]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[17]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[16]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[15]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[14]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[13]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[12]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[11]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[10]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[9]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[8]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[7]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[6]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[5]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[4]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[3]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[0]}]
set_load -pin_load 0.01035 [get_ports o_ADS1292_FILTERED_DATA_VALID]
set_load -pin_load 0 [get_ports i_CLK]
set_ideal_network [get_ports i_RSTN]
create_clock [get_ports i_CLK]  -name clk  -period 20  -waveform {0 10}
set_clock_latency 2  [get_clocks clk]
set_clock_uncertainty -setup 0.2  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 1.2  [get_ports i_CLK]
set_input_delay -clock clk  -max 1.2  [get_ports i_RSTN]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[71]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[70]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[69]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[68]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[67]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[66]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[65]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[64]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[63]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[62]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[61]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[60]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[59]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[58]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[57]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[56]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[55]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[54]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[53]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[52]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[51]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[50]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[49]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[48]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[47]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[46]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[45]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[44]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[43]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[42]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[41]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[40]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[39]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[38]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[37]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[36]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[35]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[34]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[33]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[32]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[31]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[30]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[29]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[28]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[27]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[26]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[25]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[24]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[23]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[22]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[21]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[20]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[19]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[18]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[17]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[16]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_DATA_OUT[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports i_ADS1292_DATA_VALID]
set_input_delay -clock clk  -max 1.2  [get_ports i_ADS1292_FILTERED_DATA_ACK]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[23]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[22]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[21]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[20]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[19]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[18]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[17]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[16]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[15]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[14]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[13]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[12]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[11]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[10]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[9]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[8]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_FILTERED_DATA[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports o_ADS1292_FILTERED_DATA_VALID]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[71]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[70]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[69]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[68]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[67]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[66]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[65]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[64]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[63]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[62]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[61]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[60]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[59]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[58]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[57]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[56]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[55]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[54]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[53]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[52]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[51]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[50]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[49]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[48]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[47]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[46]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[45]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[44]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[43]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[42]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[41]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[40]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[39]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[38]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[37]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[36]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[35]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[34]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[33]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[32]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[31]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[30]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[29]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[28]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[27]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[26]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[25]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[24]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[23]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[22]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[21]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[20]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[19]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[18]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[17]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[16]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[15]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[14]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[13]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[12]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[11]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[10]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[9]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[8]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[7]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[6]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[5]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[4]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[3]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[2]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[1]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_DATA_OUT[0]}]
set_input_transition -max 0.5  [get_ports i_ADS1292_DATA_VALID]
set_input_transition -max 0.5  [get_ports i_ADS1292_FILTERED_DATA_ACK]
set_input_transition -max 0.5  [get_ports i_CLK]
set_input_transition -max 0.5  [get_ports i_RSTN]
