###################################################################

# Created by write_sdc on Wed Jun 17 13:04:31 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions -max V105WTP1250 -max_library std150e_wst_105_p125\
                         -min V135BTN0400 -min_library std150e_bst_135_n040
set_max_area 0
set_disable_timing [get_ports i_RSTN]
set_disable_timing [get_pins uart_rx/i_RSTN]
set_disable_timing [get_pins uart_tx/i_RSTN]
set_disable_timing [get_cells async_rstn_synchronizer]
set_disable_timing [get_cells async_rst_synchronizer]
set_disable_timing [get_cells uart_rx/async_rst_synchronizer]
set_disable_timing [get_cells uart_tx/async_rst_synchronizer]
set_load -pin_load 0.01035 [get_ports o_UART_DATA_TX_READY]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[15]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[14]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[13]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[12]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[11]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[10]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[9]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[8]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[7]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[6]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[5]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[4]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[3]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[2]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[1]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_RX[0]}]
set_load -pin_load 0.01035 [get_ports o_UART_DATA_RX_VALID]
set_load -pin_load 0.01035 [get_ports o_UART_TXD]
set_load -pin_load 0 [get_ports i_CLK]
set_load -min -pin_load 0 [get_ports i_CLK]
set_ideal_network [get_ports i_RSTN]
set_ideal_network [get_pins uart_rx/i_RSTN]
set_ideal_network [get_pins uart_tx/i_RSTN]
create_clock [get_ports i_CLK]  -name clk  -period 10  -waveform {0 5}
set_clock_latency 0.66  [get_clocks clk]
set_clock_uncertainty 0.0804  [get_clocks clk]
set_clock_transition -max -rise 0.9 [get_clocks clk]
set_clock_transition -min -rise 0.9 [get_clocks clk]
set_clock_transition -max -fall 1.2 [get_clocks clk]
set_clock_transition -min -fall 1.2 [get_clocks clk]
set_false_path   -from [get_ports i_RSTN]
set_false_path   -to [get_cells async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -to [get_cells async_rst_synchronizer/o_RST_reg]
set_false_path   -through [list [get_pins uart_rx/i_RSTN]]
set_false_path   -to [get_cells uart_rx/async_rst_synchronizer/o_RST_reg]
set_false_path   -through [list [get_pins uart_tx/i_RSTN]]
set_false_path   -to [get_cells uart_tx/async_rst_synchronizer/o_RST_reg]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[55]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[54]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[53]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[52]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[51]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[50]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[49]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[48]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[47]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[46]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[45]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[44]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[43]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[42]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[41]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[40]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[39]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[38]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[37]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[36]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[35]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[34]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[33]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[32]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[31]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[30]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[29]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[28]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[27]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[26]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[25]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[24]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[23]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[22]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[21]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[20]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[19]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[18]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[17]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[16]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[15]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[14]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[13]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[12]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[11]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[10]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[9]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[8]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[7]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[6]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[5]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[4]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[3]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[2]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[1]}]
set_input_delay -clock clk  -max 4  [get_ports {i_UART_DATA_TX[0]}]
set_input_delay -clock clk  -max 4  [get_ports i_UART_DATA_TX_VALID]
set_input_delay -clock clk  -max 4  [get_ports i_CORE_BUSY]
set_input_delay -clock clk  -max 4  [get_ports i_UART_RXD]
set_output_delay -clock clk  -max 4  [get_ports o_UART_DATA_TX_READY]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[15]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[14]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[13]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[12]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[11]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[10]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[9]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[8]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[7]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[6]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[5]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[4]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[3]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[2]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[1]}]
set_output_delay -clock clk  -max 4  [get_ports {o_UART_DATA_RX[0]}]
set_output_delay -clock clk  -max 4  [get_ports o_UART_DATA_RX_VALID]
set_output_delay -clock clk  -max 4  [get_ports o_UART_TXD]
set_load 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_RSTN]
