###################################################################

# Created by write_sdc on Wed May  6 15:35:27 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions -max V105WTP1250 -max_library std150e_wst_105_p125\
                         -min V135BTN0400 -min_library std150e_bst_135_n040
set_max_fanout 6 [current_design]
set_max_area 0
set_disable_timing [get_ports i_RST]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[55]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[54]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[53]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[52]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[51]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[50]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[49]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[48]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[47]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[46]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[45]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[44]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[43]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[42]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[41]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[40]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[39]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[38]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[37]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[36]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[35]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[34]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[33]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[32]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[31]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[30]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[29]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[28]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[27]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[26]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[25]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[24]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[23]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[22]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[21]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[20]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[19]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[18]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[17]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[16]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[15]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[14]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[13]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[12]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[11]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[10]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[9]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[8]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[7]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[6]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[5]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[4]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[3]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[2]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[1]}]
set_load -pin_load 0.01035 [get_ports {o_UART_DATA_TX[0]}]
set_load -pin_load 0.01035 [get_ports o_UART_DATA_TX_VALID]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[7]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[6]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[5]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[4]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[3]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[2]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[1]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_REG_ADDR[0]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[7]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[6]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[5]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[4]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[3]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[2]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[1]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_DATA_IN[0]}]
set_load -pin_load 0.01035 [get_ports o_MPR121_WRITE_ENABLE]
set_load -pin_load 0.01035 [get_ports o_MPR121_READ_ENABLE]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[11]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[10]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[9]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[8]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[7]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[6]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[5]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[4]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[3]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[2]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[1]}]
set_load -pin_load 0.01035 [get_ports {o_MPR121_TOUCH_STATUS[0]}]
set_load -pin_load 0.01035 [get_ports o_MPR121_ERROR]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_CONTROL[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_CONTROL[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_CONTROL[0]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[7]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[6]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[5]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[4]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[3]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_COMMAND[0]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[7]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[6]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[5]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[4]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[3]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_REG_ADDR[0]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[7]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[6]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[5]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[4]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[3]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_DATA_IN[0]}]
set_load -pin_load 0.01035 [get_ports o_ADS1292_FILTERED_DATA_ACK]
set_load -pin_load 0.01035 [get_ports o_CHIP_SET]
set_load -pin_load 0.01035 [get_ports o_RUN_SET]
set_load -pin_load 0.01035 [get_ports o_CORE_BUSY]
set_load -pin_load 0 [get_ports i_CLK]
set_ideal_network [get_ports i_RST]
create_clock [get_ports i_CLK]  -name clk  -period 40  -waveform {0 20}
set_clock_latency 1.5  [get_clocks clk]
set_clock_uncertainty -setup 0.15  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 1.2  [get_ports i_CLK]
set_input_delay -clock clk  -max 1.2  [get_ports i_RST]
set_input_delay -clock clk  -max 1.2  [get_ports i_UART_DATA_TX_READY]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_UART_DATA_RX[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports i_UART_DATA_RX_VALID]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_MPR121_DATA_OUT[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports i_MPR121_INIT_SET]
set_input_delay -clock clk  -max 1.2  [get_ports i_MPR121_BUSY]
set_input_delay -clock clk  -max 1.2  [get_ports i_MPR121_FAIL]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[23]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[22]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[21]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[20]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[19]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[18]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[17]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[16]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_ADS1292_FILTERED_DATA_OUT[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports i_ADS1292_INIT_SET]
set_input_delay -clock clk  -max 1.2  [get_ports i_ADS1292_FILTERED_DATA_VALID]
set_input_delay -clock clk  -max 1.2  [get_ports i_ADS1292_BUSY]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[55]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[54]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[53]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[52]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[51]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[50]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[49]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[48]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[47]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[46]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[45]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[44]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[43]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[42]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[41]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[40]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[39]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[38]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[37]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[36]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[35]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[34]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[33]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[32]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[31]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[30]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[29]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[28]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[27]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[26]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[25]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[24]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[23]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[22]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[21]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[20]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[19]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[18]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[17]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[16]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[15]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[14]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[13]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[12]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[11]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[10]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[9]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[8]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_UART_DATA_TX[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports o_UART_DATA_TX_VALID]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_REG_ADDR[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_DATA_IN[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports o_MPR121_WRITE_ENABLE]
set_output_delay -clock clk  -max 1.5  [get_ports o_MPR121_READ_ENABLE]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[11]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[10]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[9]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[8]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_MPR121_TOUCH_STATUS[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports o_MPR121_ERROR]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_CONTROL[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_CONTROL[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_CONTROL[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_COMMAND[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_REG_ADDR[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[7]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[6]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[5]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[4]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[3]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[2]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[1]}]
set_output_delay -clock clk  -max 1.5  [get_ports {o_ADS1292_DATA_IN[0]}]
set_output_delay -clock clk  -max 1.5  [get_ports o_ADS1292_FILTERED_DATA_ACK]
set_output_delay -clock clk  -max 1.5  [get_ports o_CHIP_SET]
set_output_delay -clock clk  -max 1.5  [get_ports o_RUN_SET]
set_output_delay -clock clk  -max 1.5  [get_ports o_CORE_BUSY]
set_input_transition -max 0.5  [get_ports i_UART_DATA_TX_READY]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[15]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[14]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[13]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[12]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[11]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[10]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[9]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[8]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[7]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[6]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[5]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[4]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[3]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[2]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[1]}]
set_input_transition -max 0.5  [get_ports {i_UART_DATA_RX[0]}]
set_input_transition -max 0.5  [get_ports i_UART_DATA_RX_VALID]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[7]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[6]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[5]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[4]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[3]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[2]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[1]}]
set_input_transition -max 0.5  [get_ports {i_MPR121_DATA_OUT[0]}]
set_input_transition -max 0.5  [get_ports i_MPR121_INIT_SET]
set_input_transition -max 0.5  [get_ports i_MPR121_BUSY]
set_input_transition -max 0.5  [get_ports i_MPR121_FAIL]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[23]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[22]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[21]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[20]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[19]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[18]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[17]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[16]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[15]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[14]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[13]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[12]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[11]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[10]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[9]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[8]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[7]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[6]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[5]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[4]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[3]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[2]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[1]}]
set_input_transition -max 0.5  [get_ports {i_ADS1292_FILTERED_DATA_OUT[0]}]
set_input_transition -max 0.5  [get_ports i_ADS1292_INIT_SET]
set_input_transition -max 0.5  [get_ports i_ADS1292_FILTERED_DATA_VALID]
set_input_transition -max 0.5  [get_ports i_ADS1292_BUSY]
set_input_transition -max 0.5  [get_ports i_CLK]
set_input_transition -max 0.5  [get_ports i_RST]
