###################################################################

# Created by write_sdc on Thu Aug 27 13:02:48 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions -max V105WTP1250 -max_library std150e_wst_105_p125\
                         -min V135BTN0400 -min_library std150e_bst_135_n040
set_max_area 0
set_disable_timing [get_ports i_RSTN]
set_disable_timing [get_pins iir_hpf/i_RSTN]
set_disable_timing [get_pins iir_notch/i_RSTN]
set_disable_timing [get_pins iir_lpf/i_RSTN]
set_disable_timing [get_cells async_rst_synchronizer]
set_disable_timing [get_cells async_rstn_synchronizer]
set_disable_timing [get_cells iir_hpf/async_rst_synchronizer]
set_disable_timing [get_cells iir_hpf/async_rstn_synchronizer]
set_disable_timing [get_cells iir_notch/async_rst_synchronizer]
set_disable_timing [get_cells iir_notch/async_rstn_synchronizer]
set_disable_timing [get_cells iir_lpf/async_rst_synchronizer]
set_disable_timing [get_cells iir_lpf/async_rstn_synchronizer]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[23]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[22]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[21]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[20]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[19]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[18]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[17]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[16]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[15]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[14]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[13]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[12]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[11]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[10]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[9]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[8]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[7]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[6]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[5]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[4]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[3]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[2]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[1]}]
set_load -pin_load 0.01035 [get_ports {o_ADS1292_FILTERED_DATA[0]}]
set_load -pin_load 0.01035 [get_ports o_ADS1292_FILTERED_DATA_VALID]
set_load -pin_load 0 [get_ports i_CLK]
set_load -min -pin_load 0 [get_ports i_CLK]
set_ideal_network [get_ports i_RSTN]
set_ideal_network [get_pins iir_hpf/i_RSTN]
set_ideal_network [get_pins iir_notch/i_RSTN]
set_ideal_network [get_pins iir_lpf/i_RSTN]
create_clock [get_ports i_CLK]  -name clk  -period 10  -waveform {0 5}
set_clock_uncertainty 0.0804  [get_clocks clk]
set_clock_transition -max -rise 0.9 [get_clocks clk]
set_clock_transition -min -rise 0.9 [get_clocks clk]
set_clock_transition -max -fall 1.2 [get_clocks clk]
set_clock_transition -min -fall 1.2 [get_clocks clk]
set_false_path   -from [get_ports i_RSTN]
set_false_path   -to [get_cells async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -to [get_cells async_rst_synchronizer/o_RST_reg]
set_false_path   -through [list [get_pins iir_lpf/i_RSTN]]
set_false_path   -to [get_cells iir_lpf/async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -to [get_cells iir_lpf/async_rst_synchronizer/o_RST_reg]
set_false_path   -through [list [get_pins iir_hpf/i_RSTN]]
set_false_path   -to [get_cells iir_hpf/async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -to [get_cells iir_hpf/async_rst_synchronizer/o_RST_reg]
set_false_path   -through [list [get_pins iir_notch/i_RSTN]]
set_false_path   -to [get_cells iir_notch/async_rstn_synchronizer/o_RSTN_reg]
set_false_path   -to [get_cells iir_notch/async_rst_synchronizer/o_RST_reg]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[23]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[22]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[21]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[20]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[19]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[18]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[17]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[16]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[15]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[14]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[13]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[12]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[11]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[10]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[9]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[8]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[7]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[6]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[5]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[4]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[3]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[2]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[1]}]
set_input_delay -clock clk  -max 4  [get_ports {i_ADS1292_DATA_OUT[0]}]
set_input_delay -clock clk  -max 4  [get_ports i_ADS1292_DATA_VALID]
set_input_delay -clock clk  -max 4  [get_ports i_ADS1292_FILTERED_DATA_ACK]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[23]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[22]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[21]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[20]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[19]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[18]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[17]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[16]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[15]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[14]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[13]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[12]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[11]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[10]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[9]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[8]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[7]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[6]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[5]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[4]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[3]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[2]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[1]}]
set_output_delay -clock clk  -max 4  [get_ports {o_ADS1292_FILTERED_DATA[0]}]
set_output_delay -clock clk  -max 4  [get_ports o_ADS1292_FILTERED_DATA_VALID]
set_load 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_CLK]
set_resistance 0  [get_nets i_RSTN]
